In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame({'key1':['a','a','b','b','a']
                  , 'key2' :['one','two','one','two','one']
                  , 'data1': np.random.randn(5)
                  , 'data2': np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one  2.099147 -2.562164
1    a  two  0.473784  0.937472
2    b  one -0.825895 -0.825206
3    b  two -0.883566 -0.318305
4    a  one  0.412395  2.503316

In [7]:
'''
길이만 같다면 어떤 배열이라도 상관없음
'''
states = np.array(['Ohio','California','California','Ohio','Ohio'])
years = np.array([205,2005,2006,2005,2006])
print(df['data1'])
print()
print(df['data1'].groupby([states, years]).mean())

0    2.099147
1    0.473784
2   -0.825895
3   -0.883566
4    0.412395
Name: data1, dtype: float64

California  2005    0.473784
            2006   -0.825895
Ohio        205     2.099147
            2005   -0.883566
            2006    0.412395
Name: data1, dtype: float64

In [9]:
print(df) # p.389
print()
print(df.groupby(['key1','key2']).size()) # 그룹의 크기 반환

  key1 key2     data1     data2
0    a  one  2.099147 -2.562164
1    a  two  0.473784  0.937472
2    b  one -0.825895 -0.825206
3    b  two -0.883566 -0.318305
4    a  one  0.412395  2.503316

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

#### 10.1.4 함수로 그룹핑하기 p.395

In [15]:
people = pd.DataFrame(np.random.randn(5,5)
                     ,columns = ['a','b','c','d','e']
                     ,index = ['Joe', 'Steve', 'Wes','Jim', 'Travis'])

print(people)
print()
print(people.groupby(len).sum()) # 이름의 길이별로 그룹핑

               a         b         c         d         e
Joe    -1.234944  0.293976 -0.048167 -1.075126 -0.538090
Steve  -2.457108 -2.306916 -0.450896  0.395060 -1.256785
Wes    -0.135054 -1.102226  2.035068 -0.700752  0.793517
Jim    -0.440895  0.159771  1.032951  0.294909 -0.406507
Travis -2.077621 -0.850752 -1.008405  0.298578 -0.854913

          a         b         c         d         e
3 -1.810892 -0.648480  3.019851 -1.480969 -0.151080
5 -2.457108 -2.306916 -0.450896  0.395060 -1.256785
6 -2.077621 -0.850752 -1.008405  0.298578 -0.854913

In [104]:
# p.395
'''
내부적으로는 모두 배열로 반환되므로,
함수를 배열, 딕셔너리 또는 Series와 섞어 쓰는 것도 가능
'''
key_list = ['one','one','one','two','two']
people.groupby([len,key_list]).min()

              a         b         c         d         e
3 one -1.234944 -1.102226 -0.048167 -1.075126 -0.538090
  two -0.440895  0.159771  1.032951  0.294909 -0.406507
5 one -2.457108 -2.306916 -0.450896  0.395060 -1.256785
6 two -2.077621 -0.850752 -1.008405  0.298578 -0.854913

### Chapter 5. pandas 시작하기 p.181

```
pandas는 for 문을 사용하지 않고 데이터를 처리한다거나 배열 기반의 함수를 제공하는 등 NumPy 배열 기반 계산 스타일을 많이 차용함.
 
NumPy는 단일 산술 배열 데이터를 다루는 데 특화됨.
 
pandas는 표 형식의 데이터나 다양한 형태의 데이터를 다루는 데 초점을 맞춰 설계됨.
```

In [17]:
import pandas as pd # p.181
from pandas import Series, DataFrame

#### 5.1 pandas 자료구조 소개 p.182

```
1. Series
2. DataFrame
```

#### 5.1.1 Series p.182

```
일련의 객체를 담을 수 있는 1차원 배열 같은 자료구조
어떠한 NumPy 자료형이라도 담을 수 있음.

색인(인덱스)이라고 하는 배열의 데이터와 연관된 이름을 가지고 있음
```

In [18]:
# p.182
'''
왼쪽에는 색인, 오른쪽에는 해당 색인의 값이 출력됨
'''
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [20]:
# p.182
print(obj.values)
print(obj.index)  # range(4)와 유사함

[ 4  7 -5  3]
RangeIndex(start=0, stop=4, step=1)

In [21]:
# p.183
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [105]:
# p.183
print(obj2)
print()
print(obj2['a'])    # 'a'값만 출력
obj2['d'] = 6   # 'd' 값 변경
print()
print(obj2[ ['c', 'a', 'd'] ])  # 'c', 'a', 'd' 만 골라 순서대로 출력
print(obj2)
print()
print(obj2[obj2 > 0])
print()
print(obj2 * 2)
print()
print(np.exp(obj2))     # 지수 함수

d    4
b    7
a   -5
c    3
dtype: int64

-5

c    3
a   -5
d    6
dtype: int64
d    6
b    7
a   -5
c    3
dtype: int64

d    6
b    7
c    3
dtype: int64

d    12
b    14
a   -10
c     6
dtype: int64

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [25]:
# p.184
print(obj2)
print()
print('b' in obj2)
print('e' in obj2)

True
False

In [26]:
# p.184
'''
딕셔너리형 데이터로부터 Series 객체를 생성
'''
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [28]:
# p.185
'''
해당 인덱스에 있는 값을 가져오며, California 는 sdata 에 없기 때문에 NaN 으로 표시됨
'''
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [29]:
# p.185
'''
누락된 데이터를 찾을 때 주로 사용
'''
print(pd.isnull(obj4))
print()
print(pd.notnull(obj4))
# p.186
obj4.isnull()   # pandas.isnull(obj4) 과 동일

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [30]:
print(obj3)
print()
print(obj4)
print()
print(obj3 + obj4)

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [33]:
# p.187
obj4.name = 'population'    # 객체의 name
obj4.index.name = 'state'   # 인덱스의 name
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [35]:
# p.187
'''
index 변경
'''

obj = pd.Series([4, 7, -5, 3])
print(obj)
print()
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
print(obj)

0    4
1    7
2   -5
3    3
dtype: int64

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

#### 5.1.2 DataFrame p.187

```
표 같은 스프레드시트 형식의 자료구조

여러 개의 칼럼이 있는데, 각 칼럼은 서로 다른 종류의 값(숫자, 문자열, 불리언 등)을 담을 수 있음
```

In [62]:
# p.188
'''
DataFrame 객체 생성 방법1
딕셔너리와 리스트 이용
'''
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'], 'year': [2000, 2001, 2002, 2001, 2002, 2003], 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [63]:
# p.189
frame.head()    # 처음 n개의 데이터만 출력(기본값이 5)

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [64]:
frame.tail()    # 마지막 n개의 데이터만 출력(기본값이 5)

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [66]:
pd.DataFrame(data, columns=['year','state','pop'])
# 지정한 칼럼 순서대로 DataFrame 객체가 생성됨

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [59]:
# p.189
'''
없는 값을 넘기면 결측치로 저장됨
'''
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                      index=['one', 'two', 'three', 'four',
                             'five', 'six'])
print(frame2)
print(frame2.columns)

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [68]:
# p.190
'''
loc: label-location
'''
print(frame2)
print()
print(frame2.loc['three'])     # three 라는 이름의 인덱스를 가진 데이터에 접근
print(type(frame2.loc['three']))

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object
<class 'pandas.core.series.Series'>

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [71]:
# p.191
'''
값 채워넣기
'''
frame2['debt'] = 16.5
print(frame2)
print()

frame2['debt'] = np.arange(6.)
print(frame2)

# 퀴즈: debt 값을 11.0 ~ 16.0 까지 나오게 해보세요.
frame2['debt'] = np.arange(11., 17.)   # arange(시작값, 끝값, 증가값)
print(frame2)

# 퀴즈: debt 값을 11.0, 13.0, 15.0, 17.0, ... 까지 나오게 해보세요.
frame2['debt'] = np.arange(11., 22., 2)   # arange(시작값, 끝값, 증가값)
print(frame2)

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [73]:
# p.191
'''
DataFrame 에 Series 를 대입할 때는,
대입하려는 값의 길이가 DataFrame 의 크기와 동일해야 함.

Series 를 대입하면,
DataFrame 의 인덱스에 따라 값이 대입되며 존재하지 않는 색인에는 결측치가 대입됨.
'''
print(frame2)
print()

val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val    # Series 를 'debt' 칼럼에 대입
print(frame2)

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [75]:
# p.192
'''
불리언 값으로 칼럼 추가
'''
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.4
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [94]:
# p.192
del(frame2['eastern'])   # eastern 칼럼 삭제
frame2.columns

       year   state  pop  debt  eastern
one    2000    Ohio  1.5  11.0     True
two    2001    Ohio  1.7  12.0     True
three  2002    Ohio  3.6  13.0     True
four   2001  Nevada  2.4  14.0    False
five   2002  Nevada  2.9  15.0    False
six    2003  Nevada  3.2  16.0    False
12.0
13.0
14.0
15.0
16.0
17.0
       year   state  pop  debt  eastern
one    2000    Ohio  1.5  11.0     True
two    2001    Ohio  1.7  12.0     True
three  2002    Ohio  3.6  13.0     True
four   2001  Nevada  2.4  14.0    False
five   2002  Nevada  2.9  15.0    False
six    2003  Nevada  3.2  16.0    False

In [13]:
# p.193
'''
DataFrame 객체 생성 방법2
중첩된 딕셔너리 이용
'''
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [14]:
# p.193
'''
딕셔너리의 키가 인덱스로 자동 지정됨
'''
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [92]:
# p.193
frame3.T    # 데이터 전치(행과 열을 뒤집음)

       year   state  pop  debt  eastern
one    2000    Ohio  1.5  11.0     True
two    2001    Ohio  1.7  12.0     True
three  2002    Ohio  3.6  13.0     True
four   2001  Nevada  2.4  14.0    False
five   2002  Nevada  2.9  15.0    False
six    2003  Nevada  3.2  16.0    False

In [15]:
# p.193
'''
인덱스 직접 지정하기
'''
pd.DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [16]:
# p.194
'''
DataFrame의 인덱스 name 과 칼럼 name 지정
'''
frame3.index.name = 'year'
frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [7]:
print(frame3.index)
print()
print(frame3.columns)

NameError: name 'frame3' is not defined

In [99]:
# p.194
'''
DataFrame에 저장된 데이터를 2차원 배열로 나타냄
'''
frame3.values

      Nevada  Ohio
2001     2.4   1.7
2002  2009.0   3.6
2003     NaN   NaN

In [102]:
print(frame3.index)
print()
print(frame3.columns)

Int64Index([2001, 2002, 2000], dtype='int64', name='year')

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [103]:
# p.194
'''
DataFrame에 저장된 데이터를 2차원 배열로 나타냄
'''
frame3.values

array([[2.400e+00, 1.700e+00],
       [2.009e+03, 3.600e+00],
       [      nan, 1.500e+00]])

### 색인 객체
'''
색인 객체는 
'''

In [5]:
import numpy as np
import pandas as pd
obj = pd.Series(range(3), index = ['a','b','c'])
index = obj.index
print(index)
print(index[1:])
obj

Index(['a', 'b', 'c'], dtype='object')
Index(['b', 'c'], dtype='object')

a    0
b    1
c    2
dtype: int64

In [6]:
index[1] = 'd' # 색인 객체는 변경 불가

TypeError: Index does not support mutable operations

In [22]:
print(frame3)
print()
print(frame3.columns)
print()
print("Ohio" in frame3.columns)
2003 in frame3.index

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

Index(['Nevada', 'Ohio'], dtype='object', name='state')

True

False

In [25]:
#p.197
'''
파이썬의 집합과는 달리 pandas의 인덱스는 중복값을 허용함,
중복되는 값으로 데이터를 선택하면, 해당 값을 가진 모든 항목이 선택됨
'''
dup_labels = pd.Index(['foo','foo','bar','bar'])
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

### 재색인

In [26]:
obj = pd.Series([4.5,7.2,-5.3,3.6], index = ['d','b','a','c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [27]:
obj2 = obj.reindex(['a','b','c','d','e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [30]:
'''
시계열 같은 순차적인 데이터를 재색인할 때 값을 보관하거나 채워
'''
obj3 = pd.Series(['blue','purple','yellow'], index=[0,2,4])
print(obj3)
print()
print(obj3.reindex(range(6),method='ffill'))

0      blue
2    purple
4    yellow
dtype: object

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [34]:
frame = pd.DataFrame(np.arange(9).reshape((3,3))
                     , index=['a','c','d']
                     , columns = ['Ohio', 'Texas', 'California'])
print(frame)
print()

frame2 = frame.reindex(['a','b','c','d'])
print(frame2)

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [35]:
np.arange(12).reshape((3,4))

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [36]:
'''
칼럼의 재색인
'''
states = ['Texas', 'Utah','California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

## 하나의 로우(행)나 칼럼(열) 삭제하기

In [48]:
obj = pd.Series(np.arange(5.)
               , index = ['a','b','c','d','e'])
print(obj)
print()
new_obj = obj.drop('c')
print(new_obj)
print()
print(obj) # 원본은 그대로 남아있음

print(obj.drop(['a','b']))

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64
c    2.0
d    3.0
e    4.0
dtype: float64

In [50]:
data = pd.DataFrame(np.arange(16).reshape((4, 4))
                   ,index = ['Ohio','Colorado','Utah','New York']
                   ,columns = ['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [65]:
print(data.drop(['Colorado','Ohio'],axis='rows'))
print(data.drop(['Colorado','Ohio'],axis=0))
data # 원본은 그대로 남아있음

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15
          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [62]:
'''
축번호 0:행
축번호 1:열
'''
print(data.drop('two',axis=1))
print()
print(data.drop(['two','four'], axis = 'columns'))
print()
print(data) # 원본은 그대로

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [4]:
'''
inplace는 drop한 후의 데이터프레임으로 기존 데이터프레임을 대체함
'''
import pandas as pd
import numpy as np
obj = pd.Series(np.arange(5.), index=['a','b','c','d','e'])
print(obj)
print()

obj.drop('c',inplace = True)
print(obj)

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [6]:
print(obj)
print()
obj[['b','a','d']]

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

b    1.0
a    0.0
d    3.0
dtype: float64

In [7]:
print(obj)
print()

obj[[1,3]]

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

b    1.0
e    4.0
dtype: float64

In [8]:
print(obj)
print()
obj[obj<2]

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

a    0.0
b    1.0
dtype: float64

In [9]:
'''
레이블 이름으로 슬라이싱하면 시작점과 끝점을 포함
'''
obj['b':'c']

b    1.0
dtype: float64

In [10]:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
d    3.0
e    4.0
dtype: float64

In [14]:
'''
인덱싱으로 DataFrame에서 하나 이상의 칼럼 값을 가져올 수 있음
'''
data = pd.DataFrame(np.arange(16).reshape((4,4))
                   ,index = ['Ohio','Colorado','Utah','New York']
                   ,columns = ['one','two','three','four'])
print(data)
print()
print(data['two'])
print()
print(data[['three','one']])

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [18]:
'''
[] 연산자에 슬라이싱으로 행을 선택하거나 불리언 배열로 행을 선택할 수 있음,
[] 연산자에 단일 값을 넘기거간 리스트를 넘기면 열을 선택할 수 있음
'''
print(data)
print()
print(data[:2])
print()
print(data[data['three']>5])

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [21]:
print(data<5)
print()
data[data<5] = 0
print(data)

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [24]:
'''
loc[행,열]
'''
print(data)
print()
print(data.loc['Colorado',['two','three']])

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

two      5
three    6
Name: Colorado, dtype: int32

In [25]:
'''
iloc[행,열]
'''
print(data)
print()
print(data.iloc[2,[3,0,1]])
print()
print(data.iloc[2])
print()
print(data.iloc[1,2],[3,0,1])

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

four    11
one      8
two      9
Name: Utah, dtype: int32

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

6 [3, 0, 1]

In [26]:
print(data)
print()
print(data.loc[:'Utah','two']) # Label로 슬라이싱하면 해당 Label까지 포함됨
print()
print(data.iloc[:, :3][data.three>5])

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32